{
  "coursera": {
    "name": "Coursera",
    "web": "https://www.coursera.org/",
    "description": "I joined the Coursera Mobile team and worked on a bunch of cool projects, from building support for Peer review assesments to building a new main page and accomplishments page",
    "image": "coursera.png"
  },
  "enflick": {
    "name": "Enflick",
    "web": "https://www.textnow.com",
    "description": "At Enflick I worked as part of the android team on the Textnow app. It was an incredible experience, I learned a ton, and got to design and code super cool things",
    "image": "textnow.png"
  },
  "tech-retreat": {
    "name": "TechRetreat",
    "web": "http://www.techretreat.ca",
    "description": "I was one of the organizers of TechRetreat as well as a teacher for our Learnathon. In less than ten hours kids with no prior coding experience were writing working Ruby AIs for TechTanks",
    "image": "techretreat.png"
  },
  "army-commander": {
    "name": "Army Commander",
    "github": "https://github.com/jgzuke/DrawingGame",
    "description": "Create and control an army using custom or preset gestures for different formations and actions. Enemies work together and form groups to defend themselves",
    "image": "commander.jpg"
  },
  "techtanks": {
    "name": "TechTanks",
    "web": "http://techtanks.techretreat.ca/",
    "github": "https://github.com/TechRetreat/game",
    "description": "Write a ruby AI to control a tank, then test against your friends programs, all in your browser with no setup. Made for TechRetreat Learnathon",
    "image": "techtanks.png"
  },
  "3d-viewer": {
    "name": "3D Viewer",
    "github": "https://github.com/jgzuke/3DCity",
    "description": "Takes sets of connected 3D points and draws them onto a canvas. Walk and jump using screen controls and look around by rotating phone. Coded from scratch using only Android Canvas",
    "image": "3d.png"
  },
  "swipler": {
    "name": "Swipler",
    "github": "https://github.com/icechen1/Swipler",
    "description": "Chrome extention that use the doppler effect to detect hand gestures using your laptops mic and speakers. Switches/removes tabs when you swipe different directions",
    "image": "swipler.png"
  },
  "intoxicmate": {
    "name": "IntoxicMate",
    "github": "https://github.com/IntoxicM8/android",
    "description": "Uses your location, time, heart-rate etc over time to guess when you are intoxicated. IntoxicMate will then help guide you home, call a cab, or in emergencies call friends/family",
    "image": "intoxic.png"
  },
  "myoguitar": {
    "name": "MyoGuitar",
    "github": "https://github.com/jgzuke/MyoProject",
    "description": "Use the Myo to play a virtual guitar on your android device. Detects strums when you have your hand closed and uses your fingers positions to play chords on the phone",
    "image": "myoguitar.jpg"
  },
  "war-of-myths": {
    "name": "War of Myths",
    "github": "https://github.com/jgzuke/OpenWOM",
    "description": "Play as a mage and explore the world. Enemies path and search around obstacles, dodge harm, and guess your movement. Started in grade 6 as a flash game, written for android in grade 11",
    "image": "wom.png"
  },
  "engsoc": {
    "name": "EngSoc",
    "web": "https://www.engsoc.uwaterloo.ca/",
    "description": "At Uwaterloo I help out the Engineering Society as an Ambassador, Director, Orientation Leader, and First Year Mentor, as well as helping with specific events",
    "image": "engsoc.png"
  },
  "sipo": {
    "name": "SIPOFoundation",
    "web": "http://www.sipofoundation.org/",
    "description": "In Toronto I got to be part of an organization aiming to Inspire and Equip young professionals. I webmastered and helped with SIPOConference and SIPOWorkshops",
    "image": "sipo.png"
  },
  "osc": {
    "name": "Ontario Science Centre",
    "web": "http://www.ontariosciencecentre.ca/",
    "description": "After spending second semester grade 12 studying at the OSC, I also got a chance to work there as a Host, interacting with visitors and helping with shows",
    "image": "osc.png"
  },
  "find-me": {
    "name": "Find Me",
    "github": "https://github.com/jgzuke/Find-Me-Web-App",
    "description": "Create and share item lists with your friends through their email. People on a list can move and search for items, display list contents, and add or delete items",
    "image": "findme.png"
  },
  "flash-games": {
    "name": "Flash Games",
    "web": "http://jgzuke.me/Old-Flash-Games/",
    "github": "https://github.com/jgzuke/Old-Flash-Games",
    "description": "A collection of old as2 and as3 flash games made around grade 5 to 8</p><p>Follow the link to read descriptions, and play",
    "image": "throwback.png"
  },
  "ring-manager": {
    "name": "Ring Manager",
    "github": "https://github.com/jgzuke/NotificationsManager",
    "description": "Create sets of ring/vibration settings for different times/days, for example Work: 9-5 Mon-Fri. The current active set decides notification actions for certain contacts or groups",
    "image": "notif.png"
  }
}
